meeting/agenda/2023/01-24.org
:PROPERTIES:
:ID:       17091611-F9AC-46C0-A453-A940B1577D71
:END:
#+title: QT4 CG Meeting 019 Agenda 2023-01-24
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 11:00EST).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

Regrets: MK.

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2023/01-17.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

Regrets for the next meeting?

** Review of open action items [4/16]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [ ] QT4CG-015-02: NW to improve the width of the diagrams, perhaps multiple views
+ [ ] QT4CG-015-04: NW to investigate of a dynamic presentation is practical
+ [ ] QT4CG-016-02: NW to add an ed-note indicating when it was approved.
+ [ ] QT4CG-016-03: RD to add a note clarifying “known character encoding”
+ [ ] QT4CG-016-04: RD to add a note clarifying the “*”/”*” html/version combination
+ [ ] QT4CG-016-05: RD to add a “todo” noting the dependency on keyword arguments
+ [ ] QT4CG-016-06: RD to reword the introduction to mapping to clarify who’s doing the mapping
+ [ ] QT4CG-016-07: NW to make an issue about the problems of document-uri uniqueness
+ [ ] QT4CG-016-08: RD to clarify how namespace comparisons are performed.
+ [ ] QT4CG-016-09: RD to add a note stating that the local name should always be lowercase
+ [ ] QT4CG-016-10: RD to consider how to clarify /parsed/ entity parsing.
+ [X] QT4CG-018-01: MK to make a PR that removes ternary expressions.
+ [X] QT4CG-018-02: MK to review “In this notation, function-name, in bold face…” in 1.5.
+ [X] QT4CG-018-03: MK to address the issues raised in the commeont on PR 304
+ [X] QT4CG-018-04: MK to consider the editorial suggestion on “a predicate is not part of a step”

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

We have regrets from MK for this week, but some of these PRs seem
straight-forward enough to resolve in his absence.

** Review pull request #313 fn:remove()
:PROPERTIES:
:CUSTOM_ID: h-17E5E963-1899-45E2-A5C9-2922B81D3855
:END:

See [[https://qt4cg.org/dashboard/#pr-313][pull request #313]].

** Review pull request #312 minor editorial improvements
:PROPERTIES:
:CUSTOM_ID: h-7E48258D-5A4F-43AC-A346-69725B2A6858
:END:

See [[https://qt4cg.org/dashboard/#pr-312][pull request #312]].

** Review pull request #310 outstanding issues from PR #304
:PROPERTIES:
:CUSTOM_ID: h-7E48258D-5A4F-43AC-A346-69725B2A6858
:END:

See [[https://qt4cg.org/dashboard/#pr-310][pull request #310]].

** Review pull request #309 drop ternery conditionals
:PROPERTIES:
:CUSTOM_ID: h-7E48258D-5A4F-43AC-A346-69725B2A6858
:END:

See [[https://qt4cg.org/dashboard/#pr-309][pull request #309]].

** Review pull request #308 improvements to type diagrams
:PROPERTIES:
:CUSTOM_ID: h-7E48258D-5A4F-43AC-A346-69725B2A6858
:END:

See [[https://qt4cg.org/dashboard/#pr-308][pull request #308]].

** Issue #299 (formerly #281)
:PROPERTIES:
:CUSTOM_ID: h-EF7A6EB3-0BDC-4E8E-A805-8461FD43964C
:END:

We had [[https://qt4cg.org/meeting/minutes/2022/12-13.html#issue-281][some discussion]] of [[https://github.com/qt4cg/qtspecs/issues/281][#281]] previously, but no resolution. Awaiting
more feedback from the CG in the issue.

** XPath 4.0 functions
:PROPERTIES:
:CUSTOM_ID: xpath-40-functions
:END:

*** fn:duplicate-values
:PROPERTIES:
:CUSTOM_ID: fn-duplicate-values
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/123][#123]]
+ See also [[../../minutes/2022/10-04.html#h-782DCD58-658F-44BC-8AD7-1EE8301228F1][discussion from the meeting on 4 October 2022]]

*** fn:replace (action) 
:PROPERTIES:
:CUSTOM_ID: fn-replace
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-replace

*** fn:format-number (minor fixes)
:PROPERTIES:
:CUSTOM_ID: fn-format-number
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-format-number

*** fn:json
:PROPERTIES:
:CUSTOM_ID: fn-json
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-json

*** fn:differences
:PROPERTIES:
:CUSTOM_ID: fn-differences
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-differences

Editorially, this function is not ready for approval. We should decide
if we want to pursue it, and if we do, how.

*** fn:stack-trace
:PROPERTIES:
:CUSTOM_ID: fn-stack-trace
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-stack-trace

*** +map:group-by+
:PROPERTIES:
:CUSTOM_ID: map-group-by
:END:
+ +See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-group-by+

Superceded by [[https://github.com/qt4cg/qtspecs/pull/203][map:build]], per [[https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0037.html][MK]].

*** map:replace
:PROPERTIES:
:CUSTOM_ID: map-replace
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-replace

*** map:substitute
:PROPERTIES:
:CUSTOM_ID: map-substitute
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-substitute

*** map:entries
:PROPERTIES:
:CUSTOM_ID: map-entries
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/29][#29]] and [[https://github.com/qt4cg/qtspecs/issues/113][#113]]

*** array:replace
:PROPERTIES:
:CUSTOM_ID: array-replace
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-replace

*** array:slice
:PROPERTIES:
:CUSTOM_ID: array-slice
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-slice

*** array:partition
:PROPERTIES:
:CUSTOM_ID: array-partition
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-partition

*** fn:split-by-graphemes
:PROPERTIES:
:CUSTOM_ID: fn-split-by-graphemes
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/73][#73]]

*** fn:deep-normalize-space
:PROPERTIES:
:CUSTOM_ID: fn-deep-normalize-space
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/79][#79]]

*** fn:parcel, fn:unparcel, array:from-members/of, array:members/parcels
:PROPERTIES:
:CUSTOM_ID: fn-parcel-etc
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/113][#113]]

*** array:values, map:values
:PROPERTIES:
:CUSTOM_ID: array-values-map-values
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/29][#29]]

*** fn:distinct-values (semantics)
:PROPERTIES:
:CUSTOM_ID: fn-distinct-values
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-distinct-values

*** fn:deep-equal (options)
:PROPERTIES:
:CUSTOM_ID: fn-deep-equal
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-deep-equal

*** fn:parse-json (number formatting)
:PROPERTIES:
:CUSTOM_ID: fn-parse-json
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-parse-json

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
